set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_transition 1.95312 [current_design]
set_max_fanout 20 [current_design]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -no_design_rule [get_ports clk]
set_load -pin_load 0.009 [get_ports {p2d_b} ]
set_load -pin_load 0.009 [get_ports {p2d} ]
set_load -pin_load 0.009 [get_ports {p2_b} ]
set_load -pin_load 0.009 [get_ports {p2} ]
set_load -pin_load 0.009 [get_ports {p1d_b} ]
set_load -pin_load 0.009 [get_ports {p1d} ]
set_load -pin_load 0.009 [get_ports {p1_b} ]
set_load -pin_load 0.009 [get_ports {p1} ]
set_load -pin_load 0.009 [get_ports {Ad_b} ]
set_load -pin_load 0.009 [get_ports {Ad} ]
set_load -pin_load 0.009 [get_ports {A_b} ]
set_load -pin_load 0.009 [get_ports {A} ]
set_load -pin_load 0.009 [get_ports {Bd_b} ]
set_load -pin_load 0.009 [get_ports {Bd} ]
set_load -pin_load 0.009 [get_ports {B_b} ]
set_load -pin_load 0.009 [get_ports {B} ]
create_clock [get_ports clk]  -name ideal_clock  -period 195.312  -waveform {0 97.6562}
set_output_delay -clock ideal_clock  0 [get_ports {p2d_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {p2d} ]
set_output_delay -clock ideal_clock  0 [get_ports {p2_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {p2} ]
set_output_delay -clock ideal_clock  0 [get_ports {p1d_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {p1d} ]
set_output_delay -clock ideal_clock  0 [get_ports {p1_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {p1} ]
set_output_delay -clock ideal_clock  0 [get_ports {Ad_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {Ad} ]
set_output_delay -clock ideal_clock  0 [get_ports {A_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {A} ]
set_output_delay -clock ideal_clock  0 [get_ports {Bd_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {Bd} ]
set_output_delay -clock ideal_clock  0 [get_ports {B_b} ]
set_output_delay -clock ideal_clock  0 [get_ports {B} ]
set_disable_timing